{
  "title": "Senior Relationship Manager — Brazil",
  "slug": "senior-relationship-manager-brazil-ch",
  "role": "Senior Relationship Manager",
  "market": "Brazil (LatAm)",
  "location": "Zurich or Geneva",
  "seniority": "Director / Executive Director",
  "summary": "Acquire, develop and manage HNW/UHNW Brazilian clients in Switzerland; full private banking advisory and cross-border expertise.",
  "description": "## Position Overview\nThe Senior Relationship Manager is responsible for acquiring, developing, and managing a portfolio of high-net-worth (HNW) and ultra-high-net-worth (UHNW) individuals based in Brazil, serving as a trusted advisor by providing comprehensive private banking services and tailored financial solutions.\n\n## Key Responsibilities\n- Develop and expand a personal client network, especially within the Brazil market.\n- Act as a strategic advisor, offering integrated wealth management solutions across investments, lending, and estate planning.\n- Deliver full-service banking and facilitate all client transactions, collaborating with product specialists as needed.\n- Proactively identify business development opportunities and generate new leads through networking and referrals.\n- Provide consistent, high-value advice with a focus on long-term relationships and client satisfaction.\n- Maintain rigorous compliance with internal policies and regulatory guidelines, including KYC and AML standards.\n- Mentor junior staff, contribute to team goals, and share best practices within the organization.\n\n## Core Requirements\n- University degree in finance, banking, or a related field; advanced education or certifications preferred.\n- Proven track record of at least 7–10 years in private banking, with a strong portfolio of HNW/UHNW clients in Brazil.\n- Deep knowledge of financial markets, investment products, and regulatory topics.\n- Outstanding interpersonal, communication, and negotiation skills, with fluency in English and Portuguese; French or Swiss German considered a plus.\n- Demonstrated entrepreneurial drive, with experience in both client acquisition (\"hunter\") and client retention (\"farmer\") roles.\n- Swiss residency or valid permit highly desirable; cross-border experience an advantage.\n\n## Essential Competencies\n- Business acumen with a robust local network and a client-focused, ethical approach.\n- Ability to leverage internal experts and resources for holistic client solutions.\n- Strong compliance awareness and attention to detail.\n- High motivation, team spirit, and adaptability in a dynamic and demanding environment.\n\n## What Our Client Offers\n- Advanced workplace infrastructure, collaborative spaces, and diverse teams.\n- Opportunities for career progression in a client-focused, entrepreneurial setting.\n- Competitive compensation, benefits, and ongoing professional development.",
  "confidential": true,
  "active": true,
  "createdAt": "2025-09-07T16:46:00.000Z",
  "tags": ["Brazil", "Zurich", "Geneva", "UHNW", "Cross-Border"]
}